#Задача:
#Напишите 4 переменных которые буду обозначать следующие данные:
#Количество выполненных ДЗ (запишите значение 12)
#Количество затраченных часов (запишите значение 1.5)
#Название курса (запишите значение 'Python')
#Время на одно задание (вычислить используя 1 и 2 переменные)
#Выведите на экран(в консоль), используя переменные, следующую строку:
#Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.

CompletedHomework = '12'
HoursSpend = '1.5'
CourseName = "Python"
TimeofOneTask = '(1.5 / 12)'
print('Kурс:'+str(CourseName)+' ,всего задач:'+str(CompletedHomework)+' ,затрачено часов:'+str(HoursSpend)+' ,среднее время выполнения:'+str(TimeofOneTask))


